import numpy as np
#多維陣列維度/形狀操作
#觀察資料形狀
data = np.ones(10)  #[1,1,1,1,1,1,1,1,1,1]
print(data.shape)
data = np.array([[3,2,1],[4,7,6]])
print(data.shape)
print("==================================================")
#資料轉置
data = np.array([[11,12,13],[21,22,23]])
print(data.T.shape) #(2,3) ==> (3,2)
print("==================================================")
#扁平化資料
data = np.array([[[111,112,113,114],[121,122,123,124],[131,132,133,134]],[[211,212,213,214],[221,222,223,224],[231,232,233,234]]]) #(2,3,4)
newdata = data.ravel()
print(newdata)
print(newdata.shape)
print("==================================================")
#重塑資料形狀
data = np.array([[[111,112,113,114],[121,122,123,124],[131,132,133,134]],[[211,212,213,214],[221,222,223,224],[231,232,233,234]]]) #(2,3,4)
newdata = data.reshape(6,4) #(2,3,4) ==>(6,4)
print(newdata)
print(newdata.shape)
print("--------------------------------------------------")
data  = np.zeros(18).reshape(3,2,3)
print(data)
print("--------------------------------------------------")
data = np.arange(9).reshape(3,3)
print(data.T)
print(data)